#Напишите программу, которая будет преобразовывать десятичное число в двоичное.
a = int(input('Введите число для перевода в двоичную систему счисления: '))
b = 0
while a != 0:
    b = a%2
    print(b, end='')
    a = a//2

#Проблема кода в том, что читать число надо справа налево. Можно ли в данном случае как-то вывод инвертировать?